HELP_MSG = ('Мое предназначение - переносить стиль с одной фотографии на другую.\n\n'
            'Все, что тебе нужно сделать - выбрать один из предложенных мною стилей или отправить свой '
            '(сделать это можно, используя команду /show_styles), '
            'а потом отправить мне фотографию, на которую ты хочешь перенести стиль.\n\n'
            'Также можно пропустить команду /show_styles и отправить сразу /transfer_style.\n\n'
            'Стандартный размер моих творений - 256px, время работы - около одной минуты и двадцати секунд. '
            'Ты можешь улучшить или ухудишь качество, отправив мне, соответсвенно, числа 512 или 128. '
            'Имей в виду, время моей работы также изменится. \n\n'
            'И последнее: постарайся отправлять приблизительно квадратные изображения, '
            'иначе модель сожмет их, и результат будет непредсказуемый :)')

START_MSG = 'Привет!\n\nЧтобы узнать, как я работаю, запусти команду /help.'

STYLES_MSG = ('Вот примеры изображений, с которых хорошо переносится стиль.\n\n'
              'Отправь мне либо одно из них, либо свое. Учти, что оно должно обладать каким-нибудь уникальным стилем.')

ERROR_MSG = 'Сначала дождись завершения работы!'

ONLY_COMMANDS_MSG = 'Я еще не научился обрабатывать сообщения, пользуйся, пожалуйста, командами.'

PENDING_ORIGINAL_MSG = 'Теперь отправь картинку, на которую будем переносить стиль.'

PENDING_STYLE_MSG = 'Отправь мне картинку, с которой будем перенрсить стиль.'

SUCCESS_CHANGE_SIZE_MSG = 'Размер был успешно изменен. Имейте в виду, что он повлияет только на одну обработку.'
